In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import datetime as dt
import matplotlib.pyplot as plt

# Introducing DataFrames

In [2]:
# Данные о домохозяйствах в 
link = 'https://assets.datacamp.com/production/repositories/5386/datasets/1a0ab2e8557930ec06473c16521874e516a216ae/homelessness.csv'
homelessness = pd.read_csv(link)

#### Описание данных

In [4]:
# Описательные статистики
# Print the head of the homelessness data
print(homelessness.head())

# Print information about homelessness
print(homelessness.info())

# Print the shape of homelessness
print(homelessness.shape)

# Print a description of homelessness
print(homelessness.describe())

   Unnamed: 0              region       state  individuals  family_members  \
0           0  East South Central     Alabama       2570.0           864.0
1           1             Pacific      Alaska       1434.0           582.0
2           2            Mountain     Arizona       7259.0          2606.0
3           3  West South Central    Arkansas       2280.0           432.0
4           4             Pacific  California     109008.0         20964.0

   state_pop
0    4887681
1     735139
2    7158024
3    3009733
4   39461588
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 51 entries, 0 to 50
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Unnamed: 0      51 non-null     int64
 1   region          51 non-null     object
 2   state           51 non-null     object
 3   individuals     51 non-null     float64
 4   family_members  51 non-null     float64
 5   state_pop       51 non-null     int64
dtypes: float64(2), int64(2), object(2)
memory usage: 2.5+ KB
None
(51, 6)
       Unnamed: 0    individuals  family_members     state_pop
count   51.000000      51.000000       51.000000  5.100000e+01
mean    25.000000    7225.784314     3504.882353  6.405637e+06
std     14.866069   15991.025083     7805.411811  7.327258e+06
min      0.000000     434.000000       75.000000  5.776010e+05
25%     12.500000    1446.500000      592.000000  1.777414e+06
50%     25.000000    3082.000000     1482.000000  4.461153e+06
75%     37.500000    6781.500000     3196.000000  7.340946e+06
max     50.000000  109008.000000    52070.000000  3.946159e+07

#### Сортировка

In [5]:
# 
# Sort homelessness by individuals
homelessness_ind = homelessness.sort_values("individuals")

# Print the top few rows
print(homelessness_ind.head())

    Unnamed: 0              region         state  individuals  family_members  \
50          50            Mountain       Wyoming        434.0           205.0
34          34  West North Central  North Dakota        467.0            75.0
7            7      South Atlantic      Delaware        708.0           374.0
39          39         New England  Rhode Island        747.0           354.0
45          45         New England       Vermont        780.0           511.0

    state_pop
50     577601
34     758080
7      965479
39    1058287
45     624358

#### Условия

In [6]:
# Filter for rows where family_members is less than 1000 
# and region is Pacific
fam_lt_1k_pac = homelessness[(homelessness['family_members'] < 1000) & (homelessness['region'] == 'Pacific')]

# Subset for rows in South Atlantic or Mid-Atlantic regions
south_mid_atlantic = homelessness[(homelessness["region"] == "South Atlantic") | (homelessness["region"] == "Mid-Atlantic")]

# See the result
print(fam_lt_1k_pac)

   Unnamed: 0   region   state  individuals  family_members  state_pop
1           1  Pacific  Alaska       1434.0           582.0     735139

In [26]:
# The Mojave Desert states
canu = ["California", "Arizona", "Nevada", "Utah"]

# Filter for rows in the Mojave Desert states
mojave_homelessness = homelessness[homelessness["state"].isin(canu)]

# See the result
print(mojave_homelessness)

    Unnamed: 0    region       state  individuals  family_members  state_pop
2            2  Mountain     Arizona       7259.0          2606.0    7158024
4            4   Pacific  California     109008.0         20964.0   39461588
28          28  Mountain      Nevada       7058.0           486.0    3027341
44          44  Mountain        Utah       1904.0           972.0    3153550

In [29]:
homelessness.head()

,Unnamed: 0,region,state,individuals,family_members,state_pop
0,0,East South Central,Alabama,2570.0,864.0,4887681
1,1,Pacific,Alaska,1434.0,582.0,735139
2,2,Mountain,Arizona,7259.0,2606.0,7158024
3,3,West South Central,Arkansas,2280.0,432.0,3009733
4,4,Pacific,California,109008.0,20964.0,39461588

#### Нарастающие итоги

In [39]:
# Get the cumulative sum of weekly_sales, add as cum_weekly_sales col
homelessness['cum_region_pop'] = homelessness['state_pop'].cumsum()

# Get the cumulative max of weekly_sales, add as cum_max_sales col
homelessness['max_region_pop'] = homelessness['state_pop'].cummax()

# See the columns you calculated

In [40]:
homelessness.head(5)

,Unnamed: 0,region,state,individuals,family_members,state_pop,cum_region_pop,max_region_pop
0,0,East South Central,Alabama,2570.0,864.0,4887681,4887681,4887681
1,1,Pacific,Alaska,1434.0,582.0,735139,5622820,4887681
2,2,Mountain,Arizona,7259.0,2606.0,7158024,12780844,7158024
3,3,West South Central,Arkansas,2280.0,432.0,3009733,15790577,7158024
4,4,Pacific,California,109008.0,20964.0,39461588,55252165,39461588

#### Удаление дубликатов

In [37]:

state = homelessness.drop_duplicates(subset=["region"])

# Print
print(state.region)

0     East South Central
1                Pacific
2               Mountain
3     West South Central
6            New England
7         South Atlantic
13    East North Central
15    West North Central
30          Mid-Atlantic
Name: region, dtype: object

#### Подсчет переменных

In [43]:
# Подсчитаем долю каждого региона и отсортируем по убыванию
state_sorted = homelessness["region"].value_counts(sort=True, normalize=True)
print(state_sorted)

South Atlantic        0.176471
Mountain              0.156863
West North Central    0.137255
New England           0.117647
Pacific               0.098039
East North Central    0.098039
East South Central    0.078431
West South Central    0.078431
Mid-Atlantic          0.058824
Name: region, dtype: float64

#### Группировка

In [12]:
# сумма населения штатов по макрорегионам
homelessness_region_pop = homelessness.groupby("region")["state_pop"].sum()

In [13]:
homelessness_region_pop

region
East North Central    46886387
East South Central    19101485
Mid-Atlantic          41217298
Mountain              24511745
New England           14829322
Pacific               53323075
South Atlantic        65229624
West North Central    21350241
West South Central    40238324
Name: state_pop, dtype: int64

In [18]:
homelessness_region_pop = homelessness.groupby("region")["state_pop"].agg([np.min, np.max, np.mean, np.median])

In [20]:
homelessness_region_pop

                       amin      amax          mean      median
region
East North Central  5807406  12723071  9.377277e+06   9984072.0
East South Central  2981020   6771631  4.775371e+06   4674417.0
Mid-Atlantic        8886025  19530351  1.373910e+07  12800922.0
Mountain             577601   7158024  3.063968e+06   2560041.0
New England          624358   6882635  2.471554e+06   1346261.0
Pacific              735139  39461588  1.066462e+07   4181886.0
South Atlantic       701547  21244317  7.247736e+06   6035802.0
West North Central   758080   6121623  3.050034e+06   2911359.0
West South Central  3009733  28628666  1.005958e+07   4299962.5

### Сводные таблицы

In [31]:
homelessness_pivot_pop = homelessness.pivot_table(values="family_members", index="region", aggfunc=[np.mean,sum])

In [32]:
homelessness_pivot_pop

                             mean            sum
                   family_members family_members
region
East North Central    2800.400000        14002.0
East South Central     972.250000         3889.0
Mid-Atlantic         20256.333333        60769.0
Mountain              1157.250000         9258.0
New England           2916.500000        17499.0
Pacific               6632.400000        33162.0
South Atlantic        2646.444444        23818.0
West North Central    1177.428571         8242.0
West South Central    2027.500000         8110.0

In [5]:
homelessness.head(10)

,Unnamed: 0,region,state,individuals,family_members,state_pop
0,0,East South Central,Alabama,2570.0,864.0,4887681
1,1,Pacific,Alaska,1434.0,582.0,735139
2,2,Mountain,Arizona,7259.0,2606.0,7158024
3,3,West South Central,Arkansas,2280.0,432.0,3009733
4,4,Pacific,California,109008.0,20964.0,39461588
5,5,Mountain,Colorado,7607.0,3250.0,5691287
6,6,New England,Connecticut,2280.0,1696.0,3571520
7,7,South Atlantic,Delaware,708.0,374.0,965479
8,8,South Atlantic,District of Columbia,3770.0,3134.0,701547
9,9,South Atlantic,Florida,21443.0,9587.0,21244317

In [39]:
# Датасет температур

link_temperature = 'https://assets.datacamp.com/production/repositories/5386/datasets/47f5fde162bae3549ca7d5c26fb4c4639f100f28/temperatures.csv'
temperature = pd.read_csv(link_temperature)

In [40]:
temperature.head(5)

   Unnamed: 0        date     city        country  avg_temp_c
0           0  2000-01-01  Abidjan  Côte D'Ivoire      27.293
1           1  2000-02-01  Abidjan  Côte D'Ivoire      27.685
2           2  2000-03-01  Abidjan  Côte D'Ivoire      29.061
3           3  2000-04-01  Abidjan  Côte D'Ivoire      28.162
4           4  2000-05-01  Abidjan  Côte D'Ivoire      27.547

In [36]:
# Add a year column to temperatures
temperature['date'] = pd.to_datetime(temperature['date'])
temperature["year"] = temperature["date"].dt.year

In [37]:
# Pivot avg_temp_c by country and city vs year
temp_by_country_city_vs_year = temperature.pivot_table("avg_temp_c", index = ["country", "city"], columns = "year")

temp_by_country_city_vs_year

## Пропущенные значения

In [50]:
# В каких столбцах есть пропущенные значения?
temperature.isna().any()

Unnamed: 0    False
date          False
city          False
country       False
avg_temp_c     True
dtype: bool

In [52]:
# Сколько переменных пропущено
temperature.isna().sum()

Unnamed: 0     0
date           0
city           0
country        0
avg_temp_c    93
dtype: int64

In [66]:
# Строки с пустыми значениями
temperature_na = temperature[temperature['avg_temp_c'].isna()]

In [74]:
# удалить пропушенные значения
temperature = temperature.dropna()

# Join

In [2]:
taxi_owners = pd.read_pickle(r'C:\Users\roald\Desktop\datacamp\taxi_owners.p')
taxi_vehicles = pd.read_pickle(r'C:\Users\roald\Desktop\datacamp\taxi_vehicles.p')

In [7]:
# Inner join
taxi_own_veh = taxi_owners.merge(taxi_vehicles, on='vid')

# несколько ключей - пример
# ridership_cal = ridership.merge(cal, on=['year','month','day'])


# left join
# movies_financials = movies.merge(financials, on='id', how='left')


# А как называть, если разные названия колонок?
#movies_and_scifi_only = movies.merge(scifi_only, how='inner',
#                                     left_on='id', right_on='movie_id')

In [1]:
# Использование индикатора 

# Merge employees and top_cust
#empl_cust = employees.merge(top_cust, on='srid', 
#                            how='left', indicator=True)

# Select the srid column where _merge is left_only
#srid_list = empl_cust.loc[empl_cust['_merge'] == 'left_only', 'srid']

NameError: name 'employees' is not defined

In [4]:
taxi_vehicles.head(3)

    vid    make   model  year fuel_type           owner
0  2767  TOYOTA   CAMRY  2013    HYBRID  SEYED M. BADRI
1  1411  TOYOTA    RAV4  2017    HYBRID     DESZY CORP.
2  6500  NISSAN  SENTRA  2019  GASOLINE  AGAPH CAB CORP

In [5]:
taxi_owners.head(3)

     rid   vid           owner                 address    zip
0  T6285  6285  AGEAN TAXI LLC     4536 N. ELSTON AVE.  60630
1  T4862  4862    MANGIB CORP.  5717 N. WASHTENAW AVE.  60659
2  T1495  1495   FUNRIDE, INC.     3351 W. ADDISON ST.  60618

In [6]:
taxi_own_veh.head(3)

,rid,vid,owner_x,address,zip,make,model,year,fuel_type,owner_y
0,T6285,6285,AGEAN TAXI LLC,4536 N. ELSTON AVE.,60630,NISSAN,ALTIMA,2011,HYBRID,AGEAN TAXI LLC
1,T4862,4862,MANGIB CORP.,5717 N. WASHTENAW AVE.,60659,HONDA,CRV,2014,GASOLINE,MANGIB CORP.
2,T1495,1495,"FUNRIDE, INC.",3351 W. ADDISON ST.,60618,TOYOTA,SIENNA,2015,GASOLINE,"FUNRIDE, INC."

# Concat (объединение таблиц )

In [2]:
# Объединение по вертикали 

#tracks_from_albums = pd.concat([tracks_master,tracks_ride, tracks_st],
                               #sort=True,
                               #ignore_index=True)
#print(tracks_from_albums)


# объединение без пропущенных столбцов
#tracks_from_albums = pd.concat([tracks_master, tracks_ride, tracks_st],
#                               join='inner',
#                               sort=True)
#print(tracks_from_albums)

# QUERY

In [4]:
homelessness.head(3)

,Unnamed: 0,region,state,individuals,family_members,state_pop
0,0,East South Central,Alabama,2570.0,864.0,4887681
1,1,Pacific,Alaska,1434.0,582.0,735139
2,2,Mountain,Arizona,7259.0,2606.0,7158024

In [6]:
homelessness.query('region == "Pacific" and family_members > 3000')

    Unnamed: 0   region       state  individuals  family_members  state_pop
4            4  Pacific  California     109008.0         20964.0   39461588
37          37  Pacific      Oregon      11139.0          3337.0    4181886
47          47  Pacific  Washington      16424.0          5880.0    7523869